---
kind: method
id: M:Autodesk.Revit.DB.DocumentDifference.GetCreatedElementIds
source: html/1513d9fe-0282-9074-c2a3-591b9cbed7bf.htm
---
# Autodesk.Revit.DB.DocumentDifference.GetCreatedElementIds Method

Created element id collection.

## Syntax (C#)
```csharp
public ISet<ElementId> GetCreatedElementIds()
```